
## :white_check_mark: Apply Succeeded (koyashiro.me)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789046397)



<pre><code>Apply complete! Resources: 5 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashi.ro"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=mXW1Jxxi9Cxm_w4TvEv1g3eFJVpm95-i0VCWsxSmr8M"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 -all"
      + zone_id         = (sensitive value)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
cloudflare_record.cname_root: Creating...
cloudflare_record.txt_dmarc: Creating...
cloudflare_record.txt_keybase_site_verification: Creating...
cloudflare_record.txt_dkim: Creating...
cloudflare_record.txt_spf: Creating...
cloudflare_record.cname_root: Creation complete after 1s [id=c35290d7febee241c877c2ad439e9daf]
cloudflare_record.txt_dkim: Creation complete after 2s [id=80dbf03a2d184a37186cd165f566bd52]
cloudflare_record.txt_dmarc: Creation complete after 2s [id=6a46466f693a988b4e91ca8c0b65f562]
cloudflare_record.txt_keybase_site_verification: Creation complete after 2s [id=9ffb66aa4c6263e35169b118f7d8e5be]
cloudflare_record.txt_spf: Creation complete after 3s [id=8e3553954b09bb99eb9bc8b27c5cba0f]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":167,"Program":"tfcmt","SHA1":"d9515d6db11c2002c8e66a2e93767088a4432f04","Target":"koyashiro.me","Vars":{},"WorkflowName":"terraform"} -->